; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p15)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(fuel-level a2 f2) (at a2 c8)
(fuel-level a3 f2) (at a3 c7)
(at p1 c6)
(at p2 c8)
(at p3 c1)
(at p4 c1)
(at p5 c3)
(at p6 c3)
(at p7 c5)
(at p8 c2)
(at p9 c6)
(at p10 c3)
(at p11 c5)
(at p12 c5)
(at p13 c6)
(at p14 c4)
(at p15 c4)
(at p16 c3)
(at p17 c2)
(at p18 c5)
(at p19 c7)
(at p20 c1)
(at p21 c5)
(at p22 c10)
(at p23 c5)
(at p24 c2)
(at p25 c1)
(at p26 c4)
(at p27 c7)
(at p28 c6)
)
(:goal (and
(at a1 c1)
(at a2 c8)
(at a3 c7)
(at p1 c4)
(at p2 c8)
(at p3 c9)
(at p4 c5)
(at p5 c4)
(at p6 c8)
(at p7 c2)
(at p8 c5)
(at p9 c3)
(at p10 c1)
(at p11 c2)
(at p12 c3)
(at p13 c9)
(at p14 c2)
(at p15 c6)
(at p16 c1)
(at p17 c10)
(at p18 c8)
(at p19 c6)
(at p20 c7)
(at p21 c2)
(at p22 c8)
(at p23 c4)
(at p24 c10)
(at p25 c1)
(at p26 c5)
(at p27 c4)
(at p28 c6)
))
)

; plan
1. (fly a1 c1 c6 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 5 of 31
2. (board p1 a1 c6)
   deleted: (at p1 c6)
   added: (in p1 a1)
   goals met: 5 of 31
3. (fly a1 c6 c4 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 5 of 31
4. (debark p1 a1 c4)
   deleted: (in p1 a1)
   added: (at p1 c4)
   goals met: 6 of 31
5. (fly a3 c7 c1 f2 f1)
   deleted: (at a3 c7) (fuel-level a3 f2)
   added: (at a3 c1) (fuel-level a3 f1)
   goals met: 5 of 31
6. (board p3 a3 c1)
   deleted: (at p3 c1)
   added: (in p3 a3)
   goals met: 5 of 31
7. (fly a3 c1 c9 f1 f0)
   deleted: (at a3 c1) (fuel-level a3 f1)
   added: (at a3 c9) (fuel-level a3 f0)
   goals met: 5 of 31
8. (debark p3 a3 c9)
   deleted: (in p3 a3)
   added: (at p3 c9)
   goals met: 6 of 31
9. (fly a2 c8 c1 f2 f1)
   deleted: (at a2 c8) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 5 of 31
10. (board p4 a2 c1)
   deleted: (at p4 c1)
   added: (in p4 a2)
   goals met: 5 of 31
11. (fly a2 c1 c5 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c5) (fuel-level a2 f0)
   goals met: 5 of 31
12. (debark p4 a2 c5)
   deleted: (in p4 a2)
   added: (at p4 c5)
   goals met: 6 of 31
13. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 6 of 31
14. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 6 of 31
15. (board p5 a1 c3)
   deleted: (at p5 c3)
   added: (in p5 a1)
   goals met: 6 of 31
16. (fly a1 c3 c4 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 6 of 31
17. (debark p5 a1 c4)
   deleted: (in p5 a1)
   added: (at p5 c4)
   goals met: 7 of 31
18. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 31
19. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 7 of 31
20. (board p6 a1 c3)
   deleted: (at p6 c3)
   added: (in p6 a1)
   goals met: 7 of 31
21. (fly a1 c3 c8 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c8) (fuel-level a1 f0)
   goals met: 7 of 31
22. (debark p6 a1 c8)
   deleted: (in p6 a1)
   added: (at p6 c8)
   goals met: 8 of 31
23. (board p7 a2 c5)
   deleted: (at p7 c5)
   added: (in p7 a2)
   goals met: 8 of 31
24. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 8 of 31
25. (fly a2 c5 c2 f2 f1)
   deleted: (at a2 c5) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 8 of 31
26. (debark p7 a2 c2)
   deleted: (in p7 a2)
   added: (at p7 c2)
   goals met: 9 of 31
27. (board p8 a2 c2)
   deleted: (at p8 c2)
   added: (in p8 a2)
   goals met: 9 of 31
28. (fly a2 c2 c5 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c5) (fuel-level a2 f0)
   goals met: 9 of 31
29. (debark p8 a2 c5)
   deleted: (in p8 a2)
   added: (at p8 c5)
   goals met: 10 of 31
30. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 31
31. (fly a1 c8 c6 f2 f1)
   deleted: (at a1 c8) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 10 of 31
32. (board p9 a1 c6)
   deleted: (at p9 c6)
   added: (in p9 a1)
   goals met: 10 of 31
33. (fly a1 c6 c3 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 10 of 31
34. (debark p9 a1 c3)
   deleted: (in p9 a1)
   added: (at p9 c3)
   goals met: 11 of 31
35. (board p10 a1 c3)
   deleted: (at p10 c3)
   added: (in p10 a1)
   goals met: 11 of 31
36. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 11 of 31
37. (fly a1 c3 c1 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 12 of 31
38. (debark p10 a1 c1)
   deleted: (in p10 a1)
   added: (at p10 c1)
   goals met: 13 of 31
39. (board p11 a2 c5)
   deleted: (at p11 c5)
   added: (in p11 a2)
   goals met: 13 of 31
40. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 13 of 31
41. (fly a2 c5 c2 f2 f1)
   deleted: (at a2 c5) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 13 of 31
42. (debark p11 a2 c2)
   deleted: (in p11 a2)
   added: (at p11 c2)
   goals met: 14 of 31
43. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 13 of 31
44. (board p12 a1 c5)
   deleted: (at p12 c5)
   added: (in p12 a1)
   goals met: 13 of 31
45. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 31
46. (fly a1 c5 c3 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 13 of 31
47. (debark p12 a1 c3)
   deleted: (in p12 a1)
   added: (at p12 c3)
   goals met: 14 of 31
48. (fly a1 c3 c6 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c6) (fuel-level a1 f0)
   goals met: 14 of 31
49. (board p13 a1 c6)
   deleted: (at p13 c6)
   added: (in p13 a1)
   goals met: 14 of 31
50. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 14 of 31
51. (fly a1 c6 c9 f2 f1)
   deleted: (at a1 c6) (fuel-level a1 f2)
   added: (at a1 c9) (fuel-level a1 f1)
   goals met: 14 of 31
52. (debark p13 a1 c9)
   deleted: (in p13 a1)
   added: (at p13 c9)
   goals met: 15 of 31
53. (fly a1 c9 c4 f1 f0)
   deleted: (at a1 c9) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 15 of 31
54. (board p14 a1 c4)
   deleted: (at p14 c4)
   added: (in p14 a1)
   goals met: 15 of 31
55. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 31
56. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 15 of 31
57. (debark p14 a1 c2)
   deleted: (in p14 a1)
   added: (at p14 c2)
   goals met: 16 of 31
58. (fly a1 c2 c4 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 16 of 31
59. (board p15 a1 c4)
   deleted: (at p15 c4)
   added: (in p15 a1)
   goals met: 16 of 31
60. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 16 of 31
61. (fly a1 c4 c6 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 16 of 31
62. (debark p15 a1 c6)
   deleted: (in p15 a1)
   added: (at p15 c6)
   goals met: 17 of 31
63. (fly a1 c6 c3 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 17 of 31
64. (board p16 a1 c3)
   deleted: (at p16 c3)
   added: (in p16 a1)
   goals met: 17 of 31
65. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 17 of 31
66. (fly a1 c3 c1 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 18 of 31
67. (debark p16 a1 c1)
   deleted: (in p16 a1)
   added: (at p16 c1)
   goals met: 19 of 31
68. (board p17 a2 c2)
   deleted: (at p17 c2)
   added: (in p17 a2)
   goals met: 19 of 31
69. (fly a2 c2 c10 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c10) (fuel-level a2 f0)
   goals met: 19 of 31
70. (debark p17 a2 c10)
   deleted: (in p17 a2)
   added: (at p17 c10)
   goals met: 20 of 31
71. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 19 of 31
72. (board p18 a1 c5)
   deleted: (at p18 c5)
   added: (in p18 a1)
   goals met: 19 of 31
73. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 31
74. (fly a1 c5 c8 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c8) (fuel-level a1 f1)
   goals met: 19 of 31
75. (debark p18 a1 c8)
   deleted: (in p18 a1)
   added: (at p18 c8)
   goals met: 20 of 31
76. (fly a1 c8 c7 f1 f0)
   deleted: (at a1 c8) (fuel-level a1 f1)
   added: (at a1 c7) (fuel-level a1 f0)
   goals met: 20 of 31
77. (board p19 a1 c7)
   deleted: (at p19 c7)
   added: (in p19 a1)
   goals met: 20 of 31
78. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 20 of 31
79. (fly a1 c7 c6 f2 f1)
   deleted: (at a1 c7) (fuel-level a1 f2)
   added: (at a1 c6) (fuel-level a1 f1)
   goals met: 20 of 31
80. (debark p19 a1 c6)
   deleted: (in p19 a1)
   added: (at p19 c6)
   goals met: 21 of 31
81. (fly a1 c6 c1 f1 f0)
   deleted: (at a1 c6) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 22 of 31
82. (board p20 a1 c1)
   deleted: (at p20 c1)
   added: (in p20 a1)
   goals met: 22 of 31
83. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 22 of 31
84. (fly a1 c1 c7 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c7) (fuel-level a1 f1)
   goals met: 21 of 31
85. (debark p20 a1 c7)
   deleted: (in p20 a1)
   added: (at p20 c7)
   goals met: 22 of 31
86. (fly a1 c7 c5 f1 f0)
   deleted: (at a1 c7) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 22 of 31
87. (board p21 a1 c5)
   deleted: (at p21 c5)
   added: (in p21 a1)
   goals met: 22 of 31
88. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 22 of 31
89. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 22 of 31
90. (debark p21 a1 c2)
   deleted: (in p21 a1)
   added: (at p21 c2)
   goals met: 23 of 31
91. (board p22 a2 c10)
   deleted: (at p22 c10)
   added: (in p22 a2)
   goals met: 23 of 31
92. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 23 of 31
93. (fly a2 c10 c8 f2 f1)
   deleted: (at a2 c10) (fuel-level a2 f2)
   added: (at a2 c8) (fuel-level a2 f1)
   goals met: 24 of 31
94. (debark p22 a2 c8)
   deleted: (in p22 a2)
   added: (at p22 c8)
   goals met: 25 of 31
95. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 25 of 31
96. (board p23 a1 c5)
   deleted: (at p23 c5)
   added: (in p23 a1)
   goals met: 25 of 31
97. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 25 of 31
98. (fly a1 c5 c4 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 25 of 31
99. (debark p23 a1 c4)
   deleted: (in p23 a1)
   added: (at p23 c4)
   goals met: 26 of 31
100. (fly a1 c4 c2 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 26 of 31
101. (board p24 a1 c2)
   deleted: (at p24 c2)
   added: (in p24 a1)
   goals met: 26 of 31
102. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 26 of 31
103. (fly a1 c2 c10 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c10) (fuel-level a1 f1)
   goals met: 26 of 31
104. (debark p24 a1 c10)
   deleted: (in p24 a1)
   added: (at p24 c10)
   goals met: 27 of 31
105. (fly a1 c10 c4 f1 f0)
   deleted: (at a1 c10) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 27 of 31
106. (board p26 a1 c4)
   deleted: (at p26 c4)
   added: (in p26 a1)
   goals met: 27 of 31
107. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 27 of 31
108. (fly a1 c4 c5 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 27 of 31
109. (debark p26 a1 c5)
   deleted: (in p26 a1)
   added: (at p26 c5)
   goals met: 28 of 31
110. (fly a1 c5 c7 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c7) (fuel-level a1 f0)
   goals met: 28 of 31
111. (board p27 a1 c7)
   deleted: (at p27 c7)
   added: (in p27 a1)
   goals met: 28 of 31
112. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 28 of 31
113. (fly a1 c7 c4 f2 f1)
   deleted: (at a1 c7) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 28 of 31
114. (debark p27 a1 c4)
   deleted: (in p27 a1)
   added: (at p27 c4)
   goals met: 29 of 31
115. (fly a1 c4 c1 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 30 of 31
116. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 30 of 31
117. (fly a3 c9 c7 f2 f1)
   deleted: (at a3 c9) (fuel-level a3 f2)
   added: (at a3 c7) (fuel-level a3 f1)
   goals met: 31 of 31
